OpenDTEF-v2012/tutorials/compressible/rhoCentralFoam/biconic25-55Run35/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication datToFoam grid256.dat
runApplication collapseEdges -overwrite

echo "Overwriting 'patch' type as 'wedge' type in 'boundary' dictionary"
sed -if '/wedge1/,/nFaces/{s/patch/wedge/};/wedge2/,/nFaces/{s/patch/wedge/}'\
    constant/polyMesh/boundary

runApplication $(getApplication)


#------------------------------------------------------------------------------
